Revit 2024 API
StairsLanding.GetStairs Method
 Returns the stairs to which the landing belongs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Stairs GetStairs()
Visual Basic
Public Function GetStairs As Stairs
Visual C++
public:
Stairs^ GetStairs()
Return Value
 The stairs to which the landing belongs.
See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace